export const loginError = {
  formInvalid: "すべてのフォームを埋めてください",
  code400: "すべてのフォームを埋めてください",
  code401: "メールアドレスかパスワードが正しくありません",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください",
  otherError: "エラーが発生しました"
}

export const signupError = {
  formInvalid: "すべてのフォームを埋めてください",
  code400: "すべてのフォームを埋めてください",
  code401: "メールアドレスかパスワードが正しくありません",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const newReviewError = {
  formInvalid: "すべてのフォームを埋めてください",
  code400: "すべてのフォームを埋めてください",
  code401: "認証エラー",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const userUpdateError = {
  noInput: "フォームに文字を入力してください",
  code400: "フォームに文字を入力してください",
  code401: "認証エラー",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const deleteError = {
  code400: "バリデーションエラー",
  code401: "認証エラー",
  code404: "レビューが存在しません",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const getDetailError = {
  code400: "すべてのフォームを埋めてください",
  code401: "認証エラー",
  code404: "レビューが存在しません",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const getReviewError = {
  code400: "バリデーションエラー",
  code401: "認証エラー",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

export const editError = {
  formInvalid: "すべてのフォームを埋めてください",
  code400: "すべてのフォームを埋めてください",
  code401: "認証エラー",
  code404: "レビューが存在しません",
  code500: "サーバー側で問題が発生しました。しばらくたっても改善されない場合は、お手数ですが運営にお問い合わせください"
}

